DemoData/survey.tex
% Created 2017-11-29 Wed 10:09
% Intended LaTeX compiler: pdflatex
\documentclass[10pt,twocolumn]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{lmodern}
\usepackage{natbib}
\usepackage[nottoc,numbib]{tocbibind}
\usepackage{csquotes}
\usepackage{color}
\usepackage{listings}
\usepackage{color}
\usepackage[UTF8]{inputenc}
\usepackage[landscape,margin=0.25 in]{geometry}
\pagestyle{empty}
\author{Samuel W. Flint}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Samuel W. Flint},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.1.3)}, 
 pdflang={English}}
\begin{document}



\section*{Questions}
\label{sec:orgc05c7b4}

\begin{enumerate}
\item Are you male or female?
\begin{itemize}
\item Male
\item Female
\item Prefer Not to Answer
\end{itemize}
\item What is your age?
\begin{itemize}
\item Choices from 18 to 30
\item Other
\end{itemize}
\item Where do you attend college
\begin{itemize}
\item UNL
\item UNO
\item UNK
\item Another College within Nebraska
\item Other
\item I am not currently in college
\end{itemize}
\item What category is your primary major in?
\begin{itemize}
\item Engineering
\item Agricultural Sciences
\item Physical Sciences
\item Liberal Arts
\item Mathematical Sciences
\item Fine Arts
\end{itemize}
\item Where do you live?
\begin{itemize}
\item On Campus
\item Off Campus
\end{itemize}
\item How many credit hours are you taking?
\begin{itemize}
\item Less than 9
\item 9 to 15
\item 16-21
\item More than 21
\end{itemize}
\item On average, how much time do you spend studying in a week?
\begin{itemize}
\item 5 hours or less
\item 6-10
\item 11-15
\item 16-20
\item More than 20
\end{itemize}
\item Of this time, how much do you spend studying in your living area?
\begin{itemize}
\item None of it
\item Some of it
\item Most of it
\item Nearly all of it
\end{itemize}
\item Of this time, how much do you spend studying on campus?
\begin{itemize}
\item None of it
\item Some of it
\item Most of it
\item Nearly all of it
\end{itemize}
\item Of this time, how much do you spend studying off campus?
\begin{itemize}
\item None of it
\item Some of it
\item Most of it
\item Nearly all of it
\end{itemize}
\item Where is your favorite place to study?
\begin{itemize}
\item Room/Apartment/Dorm
\item Library
\item Department Building
\item Other Campus Building
\item Coffee Shop/Restaurant/Business
\item Outside/Park
\item Other
\end{itemize}
\item If the place where you spend the majority of your time studying and your favorite place to study are not the same, why? -- Select all that apply
\begin{itemize}
\item Not Applicable
\item Distractions
\item Too Loud
\item Too Quiet
\item No Room
\item Too far away
\item Insufficient tools to study successfully (No computer, whiteboard, Etc.)
\item Lacks desired comfortability (distant bathrooms, uncomfortable furniture)
\item Other
\end{itemize}
\item Please Explain what you mean by selecting ``Lacks desired comfort''.
\item If there was a space dedicated to studying, would you use it?
\begin{itemize}
\item Yes
\item No
\item Maybe
\end{itemize}
\item Do you use the UNL Learning Commons to study?
\begin{itemize}
\item Often
\item Sometimes
\item Rarely
\item Never
\end{itemize}
\item Are there any specific things you have found improve your ability to study?
\end{enumerate}


\section*{Constraints}
\label{sec:org57c17ba}

\subsection*{Standard}
\label{sec:orgb6b3e5d}

\begin{center}
\begin{tabular}{rllr}
Question & Having Response & Does & On Question\\
\hline
2 & Other & requires & 0 (End Survey)\\
3 & UNL & forbids & 14\\
3 & UNL & requires & 15\\
3 & other & requires & 0\\
5 & on & forbids & 9\\
5 & off & forbids & 10\\
12 & lacks\ldots{} & requires & 13\\
\end{tabular}
\end{center}

\subsection*{Disallow}
\label{sec:org54323c8}

\begin{center}
\begin{tabular}{rllr}
Question & Having Response & Removes Answers & From\\
\hline
8 & most & Most, Nearly All & 9\\
8 & most & Most, Nearly All & 10\\
8 & nearly all & Most, Nearly All & 9\\
8 & nearly all & Most, Nearly All & 10\\
\end{tabular}
\end{center}
\end{document}